Чистая/src/Documents/НачислениеПремииПроцентом/НачислениеПремииПроцентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПремииПроцентом</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Чистая/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.Календарь</schedule>
  <scheduleValue>InformationRegister.Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.НачисленияУдержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Чистая/src/Documents/НачислениеПремииПроцентом/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	
	
	// регистр Зарплата
	Движения.Зарплата.Очистить();
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ПремияПроцентом;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Показатель = ПроцентПремии;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	РасчётПремииПроцентом();
	
	
	
	

КонецПроцедуры 




Процедура РасчётПремииПроцентом()
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
			|	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза,
			|	ЗарплатаБазаЗарплата.Показатель КАК Показатель
			|ИЗ
			|	РегистрРасчета.Зарплата.БазаЗарплата(
			|			&Измерения,
			|			&Измерения,
			|			,
			|			Регистратор = &Регистратор
			|				И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата");
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.НачисленияУдержания.ПремияПроцентом);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	База = Запрос.Выполнить().Выбрать();
	
	Пока База.Следующий() Цикл
		
		Движение = Движения.Зарплата[База.НомерСтроки - 1]; 
		Результат = База.СуммаБаза * База.Показатель / 100; 
		Движение.Сумма = Результат;
		
		
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
			
	
КонецПроцедуры
